app/controllers/posts_controller.rb

  def index
    @user = current_user

    @post=@user.posts.all.order("created_at desc")
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY created_at desc  [["user_id", 1]]

  def update
   if @post.update post_params
---
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "LMAOOK"], ["updated_at", 2017-04-16 14:36:34 UTC], ["id", 10]]

   def create

@user = current_user
     @post = @user.posts.new post_params

     if @post.save
---
INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "d"], ["content", "ccdf"], ["created_at", 2017-04-16 08:11:29 UTC], ["updated_at", 2017-04-16 08:11:29 UTC], ["user_id", 1]]

 def search_index
  @post = Post.all
---
SELECT "posts".* FROM "posts" WHERE (title LIKE '%queeb%' OR content LIKE '%queeb%') ORDER BY created_at DESC